package java_basic_10;

/**
 * Java基礎⑩（インターフェース）
 * <p>
 * 【問題】
 * 作成した各クラスを使用して、リモコンを操作してください。
 */
public class InterfaceLesson {

    /**
     * 処理を実行するためのメインメソッド。
     *
     * @param args -
     */
    public static void main(String[] args) {
        // ■ RemoteControlインタフェースで実装したクラスのインスタンスを生成してください。


        // 生成したインスタンスのメソッドを使用してください。
        // 出力結果より、同じメソッドを使ったのに結果が異なることが確認できます。

        // ■ 電気とテレビ、スピーカーの電源をつけてください。
        // 出力結果：
        // 電気をつけました。
        // テレビの電源をつけました。
        // スピーカーの電源をつけました。


        // ■ 電気とテレビ、スピーカーの電源を消してください。
        // 出力結果：
        // 電気を消しました。
        // テレビの電源を消しました。
        // スピーカーの電源をを消しました。


        // ■ Personクラスのインスタンスを生成してください。


        // Personクラスのメソッドを使ってみましょう。
        // 個別のインスタンスからメソッドを呼ぶ時と同じく、振る舞いが変わったことが確認できます。

        // ■ 電気とテレビ、スピーカの電源をつけてください。
        // 出力結果：
        // 電気をつけました。
        // テレビの電源をつけました。
        // スピーカーの電源をつけました。


        // ■ 電気とテレビ、スピーカの電源を消してください。
        // 出力結果：
        // 電気を消しました。
        // テレビの電源を消しました。
        // スピーカーの電源をを消しました。


        // Personクラスのメソッドを使って、テレビの音量を上げ、スピーカーの音量は下げてください。
        // 出力結果：
        // テレビの音量を上げました。
        // スピーカーの音量を下げました。


    }
}