package java_basic_08;

/**
 * Java基礎⑧（インスタンス、コンストラクタ）
 * <p>
 * 【問題】
 * 作成したレシートクラスを利用して、レシートの内容を出力してください。
 */
public class ClassLesson {

    /**
     * 処理を実行するためのメインメソッド。
     *
     * @param args -
     */
    public static void main(String[] args) {
        // 1．インスタンス作成
        // ■ 以下の内容のレシートクラスのインスタンスを生成してください。

        // ① 焼肉
        // 店名：焼肉ソナム
        // 場所：自由が丘
        // 注文詳細：
        //   特上牛タン塩、1800円、4人前
        //   厚切りハラミ、1200円、5人前
        //   ボトルマッコリ、1500円、3人前
        //   冷麺、1100円、2人前


        // ② イタリアン
        // 店名：イタリアンQuattro
        // 場所：二子玉川
        // 注文詳細：
        //   マルゲリータ、950円、2人前
        //   シチリア風ミートソースピッツァ、1200円、2人前
        //   ベーコンとチョリソーのアラビアータ、1050円、3人前
        //   トマトとツナのサラダ、800円、2人前
        //   飲み放題2h、1980円、4人前


        // 3．メソッド呼び出し
        // ■ 作成したメソッドを呼び出してください。
        // インスタンス①、②を順番に引数として挿入してください。


    }

    // 2. メソッド作成
    // ■ 以下の動作をするメソッドを作成してください。
    /**
     * レシートの内容を標準出力する。
     * <p>
     * 出力結果（例）：
     * 店名：焼肉ソナム
     * 場所：自由が丘
     * 総額：19900円
     * ======================================
     *
     * @param receipt Receiptクラスのインスタンス
     */


}
